[
  {
    "id": "post-1767201303404",
    "slug": "the-impact-of-social-media-on-mental-health-2025",
    "title": "The Impact of Social Media on Mental Health (2025)",
    "date": "2025-12-31T17:15:00.000Z",
    "category": "Mental Health",
    "summary": "The text discusses how social media affects mental health. It highlights both negative effects—like stress, anxiety, low self-esteem, and poor sleep from constant comparison and online pressure—and positive aspects, such as support from online communities and access to resources. It emphasizes the importance of using social media mindfully to protect mental well-being.",
    "emoji": "💙",
    "featuredImage": "",
    "body": "Social media has become a central part of daily life, especially among young people. While it offers opportunities for connection, self-expression, and learning, excessive use can negatively impact mental health. Constant exposure to carefully curated images and posts often leads to social comparison, feelings of inadequacy, and low self-esteem. Notifications and the pressure to stay “online” can increase stress and anxiety, sometimes even affecting sleep quality. On the flip side, social media can also provide valuable mental health support through online communities, awareness campaigns, and access to resources. Striking a balance—using social media mindfully, setting boundaries, and seeking offline connections—can help protect and promote positive mental well-being.",
    "createdAt": "2025-12-31T17:15:03.404Z",
    "updatedAt": "2025-12-31T17:15:03.404Z"
  },
  {
    "id": "post-1767266063597",
    "slug": "new-year-new-me",
    "title": "New Year, New me",
    "date": "2026-01-01T11:06:00.000Z",
    "category": "Mental Health",
    "summary": "",
    "emoji": "💙",
    "featuredImage": "",
    "body": "I really wouldn't say going into a new year means you totally changing, like magic. It really just majorly focuses on your mentality. Personally, I think that a change in mindset later causes a change in the physical realm. So it doesn't mean that challenges won't be there. It doesn't mean that you won't feel bad, broken or hurt. All it means is that you're ready to embrace such comings in your life and handle them in a different way from the way you did. Additionally, change takes time. Get rid of the mentality that by you doing something today, means that at an instant everything is gonna change. Honestly, thinking that way, will make you lose hope, lose focus and short tempered. It's gonna take time to change, and this year may not be enough, and you might have to do it next year, or the year after that, but it's okay, just push on. Time isn't our major concern, is it? In the end, we wanna see improvement, whether small or big, it's still improvement. Lastly, avoid comparison, it's the killer of joy. Do things as you, don't look at how 'good' or \"successful\" this person's life is going while yours looks 'stagnant'. ",
    "createdAt": "2026-01-01T11:14:23.597Z",
    "updatedAt": "2026-01-01T11:14:23.599Z"
  }
]